API_TOKEN = '1580363270:AAFQ2gvfLiGuwtBPCTnGgdw-vsdfswFrc0U'
MY_ID = 604900292
helps_text_message = '''/start - Начать игру
/reset - Начать игру заново
/plot - Узнать сюжет'''
starts_text_message = 'Ты работаешь в ФСБ, и тебе дали задание узнать, где Джордж Буль (придумал "Алгебру Логику") спрятал секретное оружие. Известно только, что это было в его лаборатории в Линкольне. Для этого тебе придеться переместиться в прошлое в его лабораторию и выступить в роли его помощника. Поэтому тебе надо найти ответы на множество вопросов и заданий (по теме "Алгебры логики").'
n1 = '''Напишите наименьшее целое число x, для которого истинно высказывание:
        
        НЕ (X < 5) И НЕ (X > 9).'''
n2 = '''Для какого из приведённых имён истинно высказывание:

        НЕ ((Первая буква гласная) ИЛИ НЕ (Последняя согласная))?
'''

n3 = '''Логическая функция F задаётся выражением (x ≡ z ) ∨ (x → (y ∧ z)).

Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.

Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z.'''

n4 = '''Логическая функция F задаётся выражением (¬z) ∧ x ∨ x ∧ y. Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z.'''

n5 = '''Каждое из логических выражений F и G содержит 5 переменных. В таблицах истинности выражений F и G есть ровно 5 одинаковых строк, причём ровно в 4 из них в столбце значений стоит 1.

Сколько строк таблицы истинности для выражения F ∨ G содержит 1 в столбце значений?'''

otvet1 = '''Ты успел за 12 часов разобраться, где что находиться и узнал о спрятанном сейфе. На нем кодовый замок. Код состоит из 4 цифр. Рядом лежало задание, и ты предположил, что кодом является ответ на это задание.'''
n6 = '''Логическая функция F задаётся выражением x ∧ ¬y ∧ (¬z ∨ w). На рисунке приведён фрагмент таблицы истинности функции F, содержащий все наборы аргументов, при которых функция F истинна. Определите, в каком порядке располножаны переменные в столбцах таблицы истинности функции F соответствует каждая из переменных w, x, y, z.'''

otvet2 = '''Рядом лежала записка.
В ней было написанно:

Z - 5
Y - 1
X - 9
W - 7'''

otvet3 = '''Молодец, ты открыл сейф и нашел в нем проект лаборатории. Ты заметил на плане здания проход в подвал. Но когда ты нашёл в плане место, где находится подвал, то обратил внимание на дверь с другой стороны коридора. В это время ты услышал шаги, обернулся и увидел Джорджа Буля. Он спросил тебя: "Как назовем логическое "И"?" и показал 4 варианта.'''
otvet4 = '''Он ушел, а ты остался. Открыв дверь, ты увидел мешок. Там находилось то самое оружие. Вернувшись обратно в свое время, ты отдал его своему начальнику. Он тебя повысил, и ты прошел игру.'''